{
    "about": [
        "👋 Hey! I'm Johnson", "🧑🏻‍💻 Software Developer Intern @ ELL Technologies", "🎓 Computer Engineering 2026 @ University of Waterloo", "🏫 Previously Mechanical Engineering 2024 (But Transferred!)", "🔍 Currently looking for internships"
    ],

    "projects": [
        {
            "title": "Personal Website",
            "description": "This website!",
            "meta": "React, MaterialUI, Firebase, CI/CD, JavaScript, HTML, CSS",
            "info": "This is my little corner on the internet. The frontend was created using React and I'm using Firebase for the backend. Messages submitted through the contact form are stored using the Cloud Firestore database. This site is also auto-deployed using a CI/CD pipeline set up using GitHub Actions.",
            "buttons": "GitHub",
            "links": "https://github.com/johnsonduong/personal-website"
        },
        {
            "title": "PixArt",
            "description": "An online drawing application",
            "meta": "Vanilla JavaScript, HTML, CSS - No libraries!",
            "info": "I created this project to challenge myself and take my JavaScript skills to the next level. The app allows users to sketch a drawing with the ability to adjust the grid size, erase, and change the pen/background colour.",
            "buttons": "Live GitHub",
            "links": "https://johnsonduong.github.io/pixart/ https://github.com/johnsonduong/pixart"
        },
        {
            "title": "Rock Paper Scissors",
            "meta": "Vanilla JavaScript, HTML, CSS - No libraries!",
            "description": "A simple computer game",
            "info": "My first project-based introduction to JavaScript.",
            "buttons": "Live GitHub",
            "links": "https://johnsonduong.github.io/rock-paper-scissors/ https://github.com/johnsonduong/rock-paper-scissors"
        },
        {
            "title": "Monkey Business",
            "description": "A mock landing page",
            "meta": "Vanilla HTML and CSS - No libraries!",
            "info": "This is my first ever webpage! Creating this landing page was a great way for me to learn the fundamentals of HTML and CSS.",
            "buttons": "Live GitHub",
            "links": "https://johnsonduong.github.io/monkey-business-landing-page/ https://github.com/johnsonduong/monkey-business-landing-page"
        },
        {
            "title": "Bike Frame and Welding Jig",
            "description": "Engineering a bike frame from scratch",
            "meta": "SolidWorks, FEA, GD&T, Machining, Assembly",
            "info": "This was one of the projects I had working as an R&D Engineer Intern at UWaterloo. The purpose of this project was to create a bike frame from scratch to learn the fundamentals of bike and jig design. Overall, it was a great way to develop my design, analytical, and engineering skills. ",
            "buttons": "Report1 Report2",
            "links": "https://media-exp1.licdn.com/dms/document/C4E2DAQGmtS1RDddE-A/profile-treasury-document-pdf-analyzed/0/1608487555857?e=1660176000&v=beta&t=D1TYJoxxKPO6dhZkxYGURQSiEPJpXaZ7RF8pE4XOHV4 https://media-exp1.licdn.com/dms/document/C4E2DAQG5VG7id1bMSA/profile-treasury-document-pdf-analyzed/0/1608488314047?e=1660176000&v=beta&t=xFx7-tUks5aUx-LSugAZY8HzuWU_jBDs5k3pfciam3E"
        },
        {
            "title": "Lifecycle Testing Machine",
            "description": "A fatigue loading research project",
            "meta": "SolidWorks, FEA, Machining, Assembly, Arduino",
            "info": "This project was one of the undertakings I had as an R&D Engineer Intern at UWaterloo. The purpose of the project was to explore the accuracy of finite element software and real life results of cyclic loading on an armchair. I designed and built the machine from scratch and programmed an Arduino to automate the linear actuator.",
            "buttons": "Video",
            "links": "https://www.youtube.com/shorts/iL7_8Z-cFmI"
        }
    ],

    "experience": [
        {
            "company": "ELL Technologies",
            "jobTitle": "Software Developer Intern",
            "meta": "May 2022 - Aug 2022",
            "info": "",
            "buttons": "",
            "links": ""
        },
        {
            "company": "Toyota Motors",
            "jobTitle": "Facilities Engineer Intern",
            "meta": "May 2021 - Aug 2021",
            "info": "During my internship at Toyota, I led an investigation into reducing the factory chilled water production in the car manufacturing process using the Toyota Business Practice problem solving model. This Kaizen consisted of conducting root cause analysis, developing countermeasures, analyzing the results, and Yokoten. My proposal was to re-use a defunct mechanical system on site which had the potential to reduce costs by a forecasted 74% and have a payback period of 6 months. At the end of my term, I had the opportunity to present this study to senior management. Another noteworthy project that I led was migrating a paper based approval process for utility requests into electronic format by developing a virtual portal. I created multiple iterations and trial and error with other departments prior to full deployment. The project was well-received and will save countless man-hours at Toyota.",
            "buttons": "",
            "links": ""
        },
        {
            "company": "University of Waterloo",
            "jobTitle": "R&D Engineer Intern",
            "meta": "Sep 2020 - Dec 2020",
            "info": "My primary focus in this role was creating a custom bike frame, welding jig, and an armchair lifecycle testing machine. I brought all of these projects from start to finish alongside my coworkers and technicians. I led the whole design process which consisted of 3D modelling, creating engineering drawings, finite element analysis, preparing bill of materials, machining, programming an Arduino, and assembly. Some other projects/activities that I was involved with include developing a pizza kitchen simulation for Management Sciences students to explore during class labs, providing technical support for student design days, and showcasing our projects at virtual open houses.",
            "buttons": "",
            "links": ""
        }
    ]
}